###  Part # 2
  #### Terraform Format and Style 🖌``
  #### Terraform Initialization ⚙️``
  #### Terraform Plan 📖``
  <details><summary>Show Plan</summary>
  ```

  get_health_state {
          + enable_unhealthy_connection_termination = (known after apply)
        }
    }

  # aws_lb_target_group_attachment.tg1_attach[0] will be created
  + resource "aws_lb_target_group_attachment" "tg1_attach" {
      + id               = (known after apply)
      + port             = 80
      + target_group_arn = (known after apply)
      + target_id        = (known after apply)
    }

  # aws_lb_target_group_attachment.tg1_attach[1] will be created
  + resource "aws_lb_target_group_attachment" "tg1_attach" {
      + id               = (known after apply)
      + port             = 80
      + target_group_arn = (known after apply)
      + target_id        = (known after apply)
    }

Plan: 12 to add, 0 to change, 6 to destroy.
::debug::Terraform exited with code 0.
::debug::stdout: %0ANote: Objects have changed outside of Terraform%0A%0ATerraform detected the following changes made outside of Terraform since the%0Alast "terraform apply":%0A%0A  # aws_instance.acs73026[0] has changed%0A  ~ resource "aws_instance" "acs73026" {%0A        id                                   = "i-0eb0fcb2761f90514"%0A      ~ instance_state                       = "running" -> "shutting-down"%0A      ~ security_groups                      = [%0A          - "sg-0b5677fe60d72fee2",%0A        ]%0A        tags                                 = {%0A            "App"            = "Web"%0A            "Name"           = "Webserver 1"%0A            "Owner"          = "CAAacs730"%0A            "WebServerGroup" = ""%0A            "env"            = "Prod"%0A        }%0A        # (30 unchanged attributes hidden)%0A%0A%0A%0A%0A%0A%0A%0A%0A        # (8 unchanged blocks hidden)%0A    }%0A%0A  # aws_instance.acs73026[1] has changed%0A  ~ resource "aws_instance" "acs73026" {%0A        id                                   = "i-03af898491f488215"%0A      ~ instance_state                       = "running" -> "shutting-down"%0A      ~ security_groups                      = [%0A          - "sg-0b5677fe60d72fee2",%0A        ]%0A        tags                                 = {%0A            "App"            = "Web"%0A            "Name"           = "Webserver 3"%0A            "Owner"          = "CAAacs730"%0A            "WebServerGroup" = "Ansible"%0A            "env"            = "Prod"%0A        }%0A        # (30 unchanged attributes hidden)%0A%0A%0A%0A%0A%0A%0A%0A%0A        # (8 unchanged blocks hidden)%0A    }%0A%0A  # aws_instance.acs73026[2] has changed%0A  ~ resource "aws_instance" "acs73026" {%0A        id                                   = "i-0bd0b462a5b73a816"%0A      ~ instance_state                       = "running" -> "shutting-down"%0A      ~ security_groups                      = [%0A          - "sg-0b5677fe60d72fee2",%0A        ]%0A        tags                                 = {%0A            "App"            = "Web"%0A            "Name"           = "Webserver 4"%0A            "Owner"          = "CAAacs730"%0A            "WebServerGroup" = "Ansible"%0A            "env"            = "Prod"%0A        }%0A        # (30 unchanged attributes hidden)%0A%0A%0A%0A%0A%0A%0A%0A%0A        # (8 unchanged blocks hidden)%0A    }%0A%0A  # aws_instance.bastion_host has changed%0A  ~ resource "aws_instance" "bastion_host" {%0A        id                                   = "i-02967c4b78d940d6f"%0A      ~ instance_state                       = "running" -> "shutting-down"%0A      ~ security_groups                      = [%0A          - "sg-0fec65fb7834aed15",%0A        ]%0A        tags                                 = {%0A            "App"   = "Web"%0A            "Name"  = "Webserver2"%0A            "Owner" = "CAAacs730"%0A            "env"   = "Prod"%0A        }%0A        # (30 unchanged attributes hidden)%0A%0A%0A%0A%0A%0A%0A%0A%0A        # (8 unchanged blocks hidden)%0A    }%0A%0A  # aws_instance.vm_instances[0] has changed%0A  ~ resource "aws_instance" "vm_instances" {%0A        id                                   = "i-083a2b636581320a9"%0A      ~ instance_state                       = "running" -> "shutting-down"%0A      ~ security_groups                      = [%0A          - "sg-031681603caa7730b",%0A        ]%0A        tags                                 = {%0A            "App"   = "Web"%0A            "Name"  = "Prod-private-5"%0A            "Owner" = "CAAacs730"%0A            "env"   = "Prod"%0A        }%0A        # (28 unchanged attributes hidden)%0A%0A%0A%0A%0A%0A%0A%0A%0A        # (8 unchanged blocks hidden)%0A    }%0A%0A  # aws_instance.vm_instances[1] has changed%0A  ~ resource "aws_instance" "vm_instances" {%0A        id                                   = "i-053ed264fa2f5fba2"%0A      ~ instance_state                       = "running" -> "shutting-down"%0A      ~ security_groups                      = [%0A          - "sg-031681603caa7730b",%0A        ]%0A        tags                                 = {%0A            "App"   = "Web"%0A            "Name"  = "Prod-private-6"%0A            "Owner" = "CAAacs730"%0A            "env"   = "Prod"%0A        }%0A        # (28 unchanged attributes hidden)%0A%0A%0A%0A%0A%0A%0A%0A%0A        # (8 unchanged blocks hidden)%0A    }%0A%0A  # aws_key_pair.Assignment has changed%0A  ~ resource "aws_key_pair" "Assignment" {%0A        id          = "Prod"%0A      + tags        = {}%0A        # (7 unchanged attributes hidden)%0A    }%0A%0A  # aws_lb.main_alb has been deleted%0A  - resource "aws_lb" "main_alb" {%0A      - arn                                         = "arn:aws:elasticloadbalancing:us-east-1:855527989292:loadbalancer/app/alb/7da5552b403c8589" -> null%0A      - arn_suffix                                  = "app/alb/7da5552b403c8589" -> null%0A      - desync_mitigation_mode                      = "defensive" -> null%0A      - dns_name                                    = "alb-800431686.us-east-1.elb.amazonaws.com" -> null%0A      - drop_invalid_header_fields                  = false -> null%0A      - enable_cross_zone_load_balancing            = true -> null%0A      - enable_deletion_protection                  = false -> null%0A      - enable_http2                                = true -> null%0A      - enable_tls_version_and_cipher_suite_headers = false -> null%0A      - enable_waf_fail_open                        = false -> null%0A      - enable_xff_client_port                      = false -> null%0A      - id                                          = "arn:aws:elasticloadbalancing:us-east-1:855527989292:loadbalancer/app/alb/7da5552b403c8589" -> null%0A      - idle_timeout                                = 60 -> null%0A      - internal                                    = false -> null%0A      - ip_address_type                             = "ipv4" -> null%0A      - load_balancer_type                          = "application" -> null%0A      - name                                        = "alb" -> null%0A      - preserve_host_header                        = false -> null%0A      - security_groups                             = [%0A          - "sg-05d32e424b072a887",%0A        ] -> null%0A      - subnets                                     = [%0A          - "subnet-0122b6d0458ad8226",%0A          - "subnet-079310e31105f4472",%0A          - "subnet-0d3c8350d08ea83a8",%0A        ] -> null%0A      - tags                                        = {%0A          - "App"   = "Web"%0A          - "Name"  = "Prod-alb"%0A          - "Owner" = "CAAacs730"%0A          - "env"   = "Prod"%0A        } -> null%0A      - tags_all                                    = {%0A          - "App"   = "Web"%0A          - "Name"  = "Prod-alb"%0A          - "Owner" = "CAAacs730"%0A          - "env"   = "Prod"%0A        } -> null%0A      - vpc_id                                      = "vpc-01b99a788f3fe9022" -> null%0A      - xff_header_processing_mode                  = "append" -> null%0A      - zone_id                                     = "Z35SXDOTRQ7X7K" -> null%0A%0A      - access_logs {%0A          - enabled = false -> null%0A        }%0A%0A      - connection_logs {%0A          - enabled = false -> null%0A        }%0A%0A      - subnet_mapping {%0A          - subnet_id = "subnet-0122b6d0458ad8226" -> null%0A        }%0A      - subnet_mapping {%0A          - subnet_id = "subnet-079310e31105f4472" -> null%0A        }%0A      - subnet_mapping {%0A          - subnet_id = "subnet-0d3c8350d08ea83a8" -> null%0A        }%0A    }%0A%0A  # aws_lb_listener.http_listener has been deleted%0A  - resource "aws_lb_listener" "http_listener" {%0A      - arn               = "arn:aws:elasticloadbalancing:us-east-1:855527989292:listener/app/alb/7da5552b403c8589/3579946bc3af3d57" -> null%0A      - id                = "arn:aws:elasticloadbalancing:us-east-1:855527989292:listener/app/alb/7da5552b403c8589/3579946bc3af3d57" -> null%0A      - load_balancer_arn = "arn:aws:elasticloadbalancing:us-east-1:855527989292:loadbalancer/app/alb/7da5552b403c8589" -> null%0A      - port              = 80 -> null%0A      - protocol          = "HTTP" -> null%0A      - tags_all          = {} -> null%0A%0A      - default_action {%0A          - order            = 1 -> null%0A          - target_group_arn = "arn:aws:elasticloadbalancing:us-east-1:855527989292:targetgroup/tg-1/64c0c1087d1fcd86" -> null%0A          - type             = "forward" -> null%0A        }%0A    }%0A%0A  # aws_lb_target_group.tg1 has been deleted%0A  - resource "aws_lb_target_group" "tg1" {%0A      - arn                                = "arn:aws:elasticloadbalancing:us-east-1:855527989292:targetgroup/tg-1/64c0c1087d1fcd86" -> null%0A      - arn_suffix                         = "targetgroup/tg-1/64c0c1087d1fcd86" -> null%0A      - deregistration_delay               = "300" -> null%0A      - id                                 = "arn:aws:elasticloadbalancing:us-east-1:855527989292:targetgroup/tg-1/64c0c1087d1fcd86" -> null%0A      - ip_address_type                    = "ipv4" -> null%0A      - lambda_multi_value_headers_enabled = false -> null%0A      - load_balancer_arns                 = [] -> null%0A      - load_balancing_algorithm_type      = "round_robin" -> null%0A      - load_balancing_anomaly_mitigation  = "off" -> null%0A      - load_balancing_cross_zone_enabled  = "use_load_balancer_configuration" -> null%0A      - name                               = "tg-1" -> null%0A      - port                               = 80 -> null%0A      - protocol                           = "HTTP" -> null%0A      - protocol_version                   = "HTTP1" -> null%0A      - proxy_protocol_v2                  = false -> null%0A      - slow_start                         = 0 -> null%0A      - tags                               = {%0A          - "App"   = "Web"%0A          - "Name"  = "Prod-tg-1"%0A          - "Owner" = "CAAacs730"%0A          - "env"   = "Prod"%0A        } -> null%0A      - tags_all                           = {%0A          - "App"   = "Web"%0A          - "Name"  = "Prod-tg-1"%0A          - "Owner" = "CAAacs730"%0A          - "env"   = "Prod"%0A        } -> null%0A      - target_type                        = "instance" -> null%0A      - vpc_id                             = "vpc-01b99a788f3fe9022" -> null%0A%0A      - health_check {%0A          - enabled             = true -> null%0A          - healthy_threshold   = 2 -> null%0A          - interval            = 30 -> null%0A          - matcher             = "200-299" -> null%0A          - path                = "/" -> null%0A          - port                = "traffic-port" -> null%0A          - protocol            = "HTTP" -> null%0A          - timeout             = 3 -> null%0A          - unhealthy_threshold = 2 -> null%0A        }%0A%0A      - stickiness {%0A          - cookie_duration = 86400 -> null%0A          - enabled         = false -> null%0A          - type            = "lb_cookie" -> null%0A        }%0A%0A      - target_failover {}%0A%0A      - target_health_state {}%0A    }%0A%0A  # aws_lb_target_group.tg2 has been deleted%0A  - resource "aws_lb_target_group" "tg2" {%0A      - arn                                = "arn:aws:elasticloadbalancing:us-east-1:855527989292:targetgroup/tg-2/6879239782a321bc" -> null%0A      - arn_suffix                         = "targetgroup/tg-2/6879239782a321bc" -> null%0A      - deregistration_delay               = "300" -> null%0A      - id                                 = "arn:aws:elasticloadbalancing:us-east-1:855527989292:targetgroup/tg-2/6879239782a321bc" -> null%0A      - ip_address_type                    = "ipv4" -> null%0A      - lambda_multi_value_headers_enabled = false -> null%0A      - load_balancer_arns                 = [] -> null%0A      - load_balancing_algorithm_type      = "round_robin" -> null%0A      - load_balancing_anomaly_mitigation  = "off" -> null%0A      - load_balancing_cross_zone_enabled  = "use_load_balancer_configuration" -> null%0A      - name                               = "tg-2" -> null%0A      - port                               = 80 -> null%0A      - protocol                           = "HTTP" -> null%0A      - protocol_version                   = "HTTP1" -> null%0A      - proxy_protocol_v2                  = false -> null%0A      - slow_start                         = 0 -> null%0A      - tags                               = {%0A          - "App"   = "Web"%0A          - "Name"  = "Prod-tg-2"%0A          - "Owner" = "CAAacs730"%0A          - "env"   = "Prod"%0A        } -> null%0A      - tags_all                           = {%0A          - "App"   = "Web"%0A          - "Name"  = "Prod-tg-2"%0A          - "Owner" = "CAAacs730"%0A          - "env"   = "Prod"%0A        } -> null%0A      - target_type                        = "instance" -> null%0A      - vpc_id                             = "vpc-01b99a788f3fe9022" -> null%0A%0A      - health_check {%0A          - enabled             = true -> null%0A          - healthy_threshold   = 2 -> null%0A          - interval            = 30 -> null%0A          - matcher             = "200-299" -> null%0A          - path                = "/" -> null%0A          - port                = "traffic-port" -> null%0A          - protocol            = "HTTP" -> null%0A          - timeout             = 3 -> null%0A          - unhealthy_threshold = 2 -> null%0A        }%0A%0A      - stickiness {%0A          - cookie_duration = 86400 -> null%0A          - enabled         = false -> null%0A          - type            = "lb_cookie" -> null%0A        }%0A%0A      - target_failover {}%0A%0A      - target_health_state {}%0A    }%0A%0A  # aws_lb_target_group_attachment.tg1_attach[0] has been deleted%0A  - resource "aws_lb_target_group_attachment" "tg1_attach" {%0A      - id               = "arn:aws:elasticloadbalancing:us-east-1:855527989292:targetgroup/tg-1/64c0c1087d1fcd86-2024041818511745070000000a" -> null%0A      - port             = 80 -> null%0A      - target_group_arn = "arn:aws:elasticloadbalancing:us-east-1:855527989292:targetgroup/tg-1/64c0c1087d1fcd86" -> null%0A      - target_id        = "i-0eb0fcb2761f90514" -> null%0A    }%0A%0A  # aws_lb_target_group_attachment.tg1_attach[1] has been deleted%0A  - resource "aws_lb_target_group_attachment" "tg1_attach" {%0A      - id               = "arn:aws:elasticloadbalancing:us-east-1:855527989292:targetgroup/tg-1/64c0c1087d1fcd86-20240418185117377200000009" -> null%0A      - port             = 80 -> null%0A      - target_group_arn = "arn:aws:elasticloadbalancing:us-east-1:855527989292:targetgroup/tg-1/64c0c1087d1fcd86" -> null%0A      - target_id        = "i-03af898491f488215" -> null%0A    }%0A%0A  # aws_security_group.bastion_sg has changed%0A  ~ resource "aws_security_group" "bastion_sg" {%0A        id                     = "sg-0fec65fb7834aed15"%0A        name                   = "terraform-20240418184952551000000001"%0A      + tags                   = {}%0A        # (9 unchanged attributes hidden)%0A    }%0A%0A  # aws_security_group.vm_sg has changed%0A  ~ resource "aws_security_group" "vm_sg" {%0A        id                     = "sg-031681603caa7730b"%0A        name                   = "terraform-20240418184954938600000005"%0A      + tags                   = {}%0A        # (9 unchanged attributes hidden)%0A    }%0A%0A%0AUnless you have made equivalent changes to your configuration, or ignored the%0Arelevant attributes using ignore_changes, the following plan may include%0Aactions to undo or respond to these changes.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A-/+ destroy and then create replacement%0A+/- create replacement and then destroy%0A%0ATerraform will perform the following actions:%0A%0A  # aws_instance.acs73026[0] must be replaced%0A+/- resource "aws_instance" "acs73026" {%0A      ~ arn                                  = "arn:aws:ec2:us-east-1:855527989292:instance/i-0eb0fcb2761f90514" -> (known after apply)%0A      ~ availability_zone                    = "us-east-1a" -> (known after apply)%0A      ~ cpu_core_count                       = 1 -> (known after apply)%0A      ~ cpu_threads_per_core                 = 1 -> (known after apply)%0A      ~ disable_api_stop                     = false -> (known after apply)%0A      ~ disable_api_termination              = false -> (known after apply)%0A      ~ ebs_optimized                        = false -> (known after apply)%0A      - hibernation                          = false -> null%0A      + host_id                              = (known after apply)%0A      + host_resource_group_arn              = (known after apply)%0A      + iam_instance_profile                 = (known after apply)%0A      ~ id                                   = "i-0eb0fcb2761f90514" -> (known after apply)%0A      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)%0A      + instance_lifecycle                   = (known after apply)%0A      ~ instance_state                       = "shutting-down" -> (known after apply)%0A      ~ ipv6_address_count                   = 0 -> (known after apply)%0A      ~ ipv6_addresses                       = [] -> (known after apply)%0A      ~ monitoring                           = false -> (known after apply)%0A      + outpost_arn                          = (known after apply)%0A      + password_data                        = (known after apply)%0A      + placement_group                      = (known after apply)%0A      ~ placement_partition_number           = 0 -> (known after apply)%0A      ~ primary_network_interface_id         = "eni-0b7e017754ddcffd2" -> (known after apply)%0A      ~ private_dns                          = "ip-10-1-1-173.ec2.internal" -> (known after apply)%0A      ~ private_ip                           = "10.1.1.173" -> (known after apply)%0A      + public_dns                           = (known after apply)%0A      ~ public_ip                            = "100.26.143.149" -> (known after apply)%0A      ~ secondary_private_ips                = [] -> (known after apply)%0A      ~ security_groups                      = [ # forces replacement%0A          + "sg-0b5677fe60d72fee2",%0A        ]%0A      + spot_instance_request_id             = (known after apply)%0A        tags                                 = {%0A            "App"            = "Web"%0A            "Name"           = "Webserver 1"%0A            "Owner"          = "CAAacs730"%0A            "WebServerGroup" = ""%0A            "env"            = "Prod"%0A        }%0A      ~ tags_all                             = {%0A          - "App"            = "Web"%0A          - "Name"           = "Webserver 1"%0A          - "Owner"          = "CAAacs730"%0A          - "WebServerGroup" = ""%0A          - "env"            = "Prod"%0A        } -> (known after apply)%0A      ~ tenancy                              = "default" -> (known after apply)%0A      + user_data_base64                     = (known after apply)%0A      ~ vpc_security_group_ids               = [%0A          - "sg-0b5677fe60d72fee2",%0A        ] -> (known after apply)%0A        # (9 unchanged attributes hidden)%0A%0A      ~ capacity_reservation_specification {%0A          ~ capacity_reservation_preference = "open" -> (known after apply)%0A%0A          + capacity_reservation_target {%0A              + capacity_reservation_id                 = (known after apply)%0A              + capacity_reservation_resource_group_arn = (known after apply)%0A            }%0A        }%0A%0A      ~ cpu_options {%0A          + amd_sev_snp      = (known after apply)%0A          ~ core_count       = 1 -> (known after apply)%0A          ~ threads_per_core = 1 -> (known after apply)%0A        }%0A%0A      - credit_specification {%0A          - cpu_credits = "standard" -> null%0A        }%0A%0A      + ebs_block_device {%0A          + delete_on_termination = (known after apply)%0A          + device_name           = (known after apply)%0A          + encrypted             = (known after apply)%0A          + iops                  = (known after apply)%0A          + kms_key_id            = (known after apply)%0A          + snapshot_id           = (known after apply)%0A          + tags                  = (known after apply)%0A          + tags_all              = (known after apply)%0A          + throughput            = (known after apply)%0A          + volume_id             = (known after apply)%0A          + volume_size           = (known after apply)%0A          + volume_type           = (known after apply)%0A        }%0A%0A      ~ enclave_options {%0A          ~ enabled = false -> (known after apply)%0A        }%0A%0A      + ephemeral_block_device {%0A          + device_name  = (known after apply)%0A          + no_device    = (known after apply)%0A          + virtual_name = (known after apply)%0A        }%0A%0A      + instance_market_options {%0A          + market_type = (known after apply)%0A%0A          + spot_options {%0A              + instance_interruption_behavior = (known after apply)%0A              + max_price                      = (known after apply)%0A              + spot_instance_type             = (known after apply)%0A              + valid_until                    = (known after apply)%0A            }%0A        }%0A%0A      ~ maintenance_options {%0A          ~ auto_recovery = "default" -> (known after apply)%0A        }%0A%0A      ~ metadata_options {%0A          ~ http_endpoint               = "enabled" -> (known after apply)%0A          ~ http_protocol_ipv6          = "disabled" -> (known after apply)%0A          ~ http_put_response_hop_limit = 1 -> (known after apply)%0A          ~ http_tokens                 = "optional" -> (known after apply)%0A          ~ instance_metadata_tags      = "disabled" -> (known after apply)%0A        }%0A%0A      + network_interface {%0A          + delete_on_termination = (known after apply)%0A          + device_index          = (known after apply)%0A          + network_card_index    = (known after apply)%0A          + network_interface_id  = (known after apply)%0A        }%0A%0A      ~ private_dns_name_options {%0A          ~ enable_resource_name_dns_a_record    = false -> (known after apply)%0A          ~ enable_resource_name_dns_aaaa_record = false -> (known after apply)%0A          ~ hostname_type                        = "ip-name" -> (known after apply)%0A        }%0A%0A      ~ root_block_device {%0A          ~ delete_on_termination = true -> (known after apply)%0A          ~ device_name           = "/dev/xvda" -> (known after apply)%0A          ~ encrypted             = false -> (known after apply)%0A          ~ iops                  = 100 -> (known after apply)%0A          + kms_key_id            = (known after apply)%0A          ~ tags                  = {} -> (known after apply)%0A          ~ tags_all              = {} -> (known after apply)%0A          ~ throughput            = 0 -> (known after apply)%0A          ~ volume_id             = "vol-0d9be86899ae1c204" -> (known after apply)%0A          ~ volume_size           = 8 -> (known after apply)%0A          ~ volume_type           = "gp2" -> (known after apply)%0A        }%0A    }%0A%0A  # aws_instance.acs73026[1] must be replaced%0A+/- resource "aws_instance" "acs73026" {%0A      ~ arn                                  = "arn:aws:ec2:us-east-1:855527989292:instance/i-03af898491f488215" -> (known after apply)%0A      ~ availability_zone                    = "us-east-1c" -> (known after apply)%0A      ~ cpu_core_count                       = 1 -> (known after apply)%0A      ~ cpu_threads_per_core                 = 1 -> (known after apply)%0A      ~ disable_api_stop                     = false -> (known after apply)%0A      ~ disable_api_termination              = false -> (known after apply)%0A      ~ ebs_optimized                        = false -> (known after apply)%0A      - hibernation                          = false -> null%0A      + host_id                              = (known after apply)%0A      + host_resource_group_arn              = (known after apply)%0A      + iam_instance_profile                 = (known after apply)%0A      ~ id                                   = "i-03af898491f488215" -> (known after apply)%0A      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)%0A      + instance_lifecycle                   = (known after apply)%0A      ~ instance_state                       = "shutting-down" -> (known after apply)%0A      ~ ipv6_address_count                   = 0 -> (known after apply)%0A      ~ ipv6_addresses                       = [] -> (known after apply)%0A      ~ monitoring                           = false -> (known after apply)%0A      + outpost_arn                          = (known after apply)%0A      + password_data                        = (known after apply)%0A      + placement_group                      = (known after apply)%0A      ~ placement_partition_number           = 0 -> (known after apply)%0A      ~ primary_network_interface_id         = "eni-0cb8397c94c4734b0" -> (known after apply)%0A      ~ private_dns                          = "ip-10-1-3-242.ec2.internal" -> (known after apply)%0A      ~ private_ip                           = "10.1.3.242" -> (known after apply)%0A      + public_dns                           = (known after apply)%0A      ~ public_ip                            = "3.93.39.198" -> (known after apply)%0A      ~ secondary_private_ips                = [] -> (known after apply)%0A      ~ security_groups                      = [ # forces replacement%0A          + "sg-0b5677fe60d72fee2",%0A        ]%0A      + spot_instance_request_id             = (known after apply)%0A        tags                                 = {%0A            "App"            = "Web"%0A            "Name"           = "Webserver 3"%0A            "Owner"          = "CAAacs730"%0A            "WebServerGroup" = "Ansible"%0A            "env"            = "Prod"%0A        }%0A      ~ tenancy                              = "default" -> (known after apply)%0A      + user_data_base64                     = (known after apply)%0A      ~ vpc_security_group_ids               = [%0A          - "sg-0b5677fe60d72fee2",%0A        ] -> (known after apply)%0A        # (10 unchanged attributes hidden)%0A%0A      ~ capacity_reservation_specification {%0A          ~ capacity_reservation_preference = "open" -> (known after apply)%0A%0A          + capacity_reservation_target {%0A              + capacity_reservation_id                 = (known after apply)%0A              + capacity_reservation_resource_group_arn = (known after apply)%0A            }%0A        }%0A%0A      ~ cpu_options {%0A          + amd_sev_snp      = (known after apply)%0A          ~ core_count       = 1 -> (known after apply)%0A          ~ threads_per_core = 1 -> (known after apply)%0A        }%0A%0A      - credit_specification {%0A          - cpu_credits = "standard" -> null%0A        }%0A%0A      + ebs_block_device {%0A          + delete_on_termination = (known after apply)%0A          + device_name           = (known after apply)%0A          + encrypted             = (known after apply)%0A          + iops                  = (known after apply)%0A          + kms_key_id            = (known after apply)%0A          + snapshot_id           = (known after apply)%0A          + tags                  = (known after apply)%0A          + tags_all              = (known after apply)%0A          + throughput            = (known after apply)%0A          + volume_id             = (known after apply)%0A          + volume_size           = (known after apply)%0A          + volume_type           = (known after apply)%0A        }%0A%0A      ~ enclave_options {%0A          ~ enabled = false -> (known after apply)%0A        }%0A%0A      + ephemeral_block_device {%0A          + device_name  = (known after apply)%0A          + no_device    = (known after apply)%0A          + virtual_name = (known after apply)%0A        }%0A%0A      + instance_market_options {%0A          + market_type = (known after apply)%0A%0A          + spot_options {%0A              + instance_interruption_behavior = (known after apply)%0A              + max_price                      = (known after apply)%0A              + spot_instance_type             = (known after apply)%0A              + valid_until                    = (known after apply)%0A            }%0A        }%0A%0A      ~ maintenance_options {%0A          ~ auto_recovery = "default" -> (known after apply)%0A        }%0A%0A      ~ metadata_options {%0A          ~ http_endpoint               = "enabled" -> (known after apply)%0A          ~ http_protocol_ipv6          = "disabled" -> (known after apply)%0A          ~ http_put_response_hop_limit = 1 -> (known after apply)%0A          ~ http_tokens                 = "optional" -> (known after apply)%0A          ~ instance_metadata_tags      = "disabled" -> (known after apply)%0A        }%0A%0A      + network_interface {%0A          + delete_on_termination = (known after apply)%0A          + device_index          = (known after apply)%0A          + network_card_index    = (known after apply)%0A          + network_interface_id  = (known after apply)%0A        }%0A%0A      ~ private_dns_name_options {%0A          ~ enable_resource_name_dns_a_record    = false -> (known after apply)%0A          ~ enable_resource_name_dns_aaaa_record = false -> (known after apply)%0A          ~ hostname_type                        = "ip-name" -> (known after apply)%0A        }%0A%0A      ~ root_block_device {%0A          ~ delete_on_termination = true -> (known after apply)%0A          ~ device_name           = "/dev/xvda" -> (known after apply)%0A          ~ encrypted             = false -> (known after apply)%0A          ~ iops                  = 100 -> (known after apply)%0A          + kms_key_id            = (known after apply)%0A          ~ tags                  = {} -> (known after apply)%0A          ~ tags_all              = {} -> (known after apply)%0A          ~ throughput            = 0 -> (known after apply)%0A          ~ volume_id             = "vol-05d6a4396ad3faabf" -> (known after apply)%0A          ~ volume_size           = 8 -> (known after apply)%0A          ~ volume_type           = "gp2" -> (known after apply)%0A        }%0A    }%0A%0A  # aws_instance.acs73026[2] must be replaced%0A+/- resource "aws_instance" "acs73026" {%0A      ~ arn                                  = "arn:aws:ec2:us-east-1:855527989292:instance/i-0bd0b462a5b73a816" -> (known after apply)%0A      ~ availability_zone                    = "us-east-1d" -> (known after apply)%0A      ~ cpu_core_count                       = 1 -> (known after apply)%0A      ~ cpu_threads_per_core                 = 1 -> (known after apply)%0A      ~ disable_api_stop                     = false -> (known after apply)%0A      ~ disable_api_termination              = false -> (known after apply)%0A      ~ ebs_optimized                        = false -> (known after apply)%0A      - hibernation                          = false -> null%0A      + host_id                              = (known after apply)%0A      + host_resource_group_arn              = (known after apply)%0A      + iam_instance_profile                 = (known after apply)%0A      ~ id                                   = "i-0bd0b462a5b73a816" -> (known after apply)%0A      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)%0A      + instance_lifecycle                   = (known after apply)%0A      ~ instance_state                       = "shutting-down" -> (known after apply)%0A      ~ ipv6_address_count                   = 0 -> (known after apply)%0A      ~ ipv6_addresses                       = [] -> (known after apply)%0A      ~ monitoring                           = false -> (known after apply)%0A      + outpost_arn                          = (known after apply)%0A      + password_data                        = (known after apply)%0A      + placement_group                      = (known after apply)%0A      ~ placement_partition_number           = 0 -> (known after apply)%0A      ~ primary_network_interface_id         = "eni-0ce4c5d04234bc22e" -> (known after apply)%0A      ~ private_dns                          = "ip-10-1-4-220.ec2.internal" -> (known after apply)%0A      ~ private_ip                           = "10.1.4.220" -> (known after apply)%0A      + public_dns                           = (known after apply)%0A      ~ public_ip                            = "3.88.222.158" -> (known after apply)%0A      ~ secondary_private_ips                = [] -> (known after apply)%0A      ~ security_groups                      = [ # forces replacement%0A          + "sg-0b5677fe60d72fee2",%0A        ]%0A      + spot_instance_request_id             = (known after apply)%0A        tags                                 = {%0A            "App"            = "Web"%0A            "Name"           = "Webserver 4"%0A            "Owner"          = "CAAacs730"%0A            "WebServerGroup" = "Ansible"%0A            "env"            = "Prod"%0A        }%0A      ~ tenancy                              = "default" -> (known after apply)%0A      + user_data_base64                     = (known after apply)%0A      ~ vpc_security_group_ids               = [%0A          - "sg-0b5677fe60d72fee2",%0A        ] -> (known after apply)%0A        # (10 unchanged attributes hidden)%0A%0A      ~ capacity_reservation_specification {%0A          ~ capacity_reservation_preference = "open" -> (known after apply)%0A%0A          + capacity_reservation_target {%0A              + capacity_reservation_id                 = (known after apply)%0A              + capacity_reservation_resource_group_arn = (known after apply)%0A            }%0A        }%0A%0A      ~ cpu_options {%0A          + amd_sev_snp      = (known after apply)%0A          ~ core_count       = 1 -> (known after apply)%0A          ~ threads_per_core = 1 -> (known after apply)%0A        }%0A%0A      - credit_specification {%0A          - cpu_credits = "standard" -> null%0A        }%0A%0A      + ebs_block_device {%0A          + delete_on_termination = (known after apply)%0A          + device_name           = (known after apply)%0A          + encrypted             = (known after apply)%0A          + iops                  = (known after apply)%0A          + kms_key_id            = (known after apply)%0A          + snapshot_id           = (known after apply)%0A          + tags                  = (known after apply)%0A          + tags_all              = (known after apply)%0A          + throughput            = (known after apply)%0A          + volume_id             = (known after apply)%0A          + volume_size           = (known after apply)%0A          + volume_type           = (known after apply)%0A        }%0A%0A      ~ enclave_options {%0A          ~ enabled = false -> (known after apply)%0A        }%0A%0A      + ephemeral_block_device {%0A          + device_name  = (known after apply)%0A          + no_device    = (known after apply)%0A          + virtual_name = (known after apply)%0A        }%0A%0A      + instance_market_options {%0A          + market_type = (known after apply)%0A%0A          + spot_options {%0A              + instance_interruption_behavior = (known after apply)%0A              + max_price                      = (known after apply)%0A              + spot_instance_type             = (known after apply)%0A              + valid_until                    = (known after apply)%0A            }%0A        }%0A%0A      ~ maintenance_options {%0A          ~ auto_recovery = "default" -> (known after apply)%0A        }%0A%0A      ~ metadata_options {%0A          ~ http_endpoint               = "enabled" -> (known after apply)%0A          ~ http_protocol_ipv6          = "disabled" -> (known after apply)%0A          ~ http_put_response_hop_limit = 1 -> (known after apply)%0A          ~ http_tokens                 = "optional" -> (known after apply)%0A          ~ instance_metadata_tags      = "disabled" -> (known after apply)%0A        }%0A%0A      + network_interface {%0A          + delete_on_termination = (known after apply)%0A          + device_index          = (known after apply)%0A          + network_card_index    = (known after apply)%0A          + network_interface_id  = (known after apply)%0A        }%0A%0A      ~ private_dns_name_options {%0A          ~ enable_resource_name_dns_a_record    = false -> (known after apply)%0A          ~ enable_resource_name_dns_aaaa_record = false -> (known after apply)%0A          ~ hostname_type                        = "ip-name" -> (known after apply)%0A        }%0A%0A      ~ root_block_device {%0A          ~ delete_on_termination = true -> (known after apply)%0A          ~ device_name           = "/dev/xvda" -> (known after apply)%0A          ~ encrypted             = false -> (known after apply)%0A          ~ iops                  = 100 -> (known after apply)%0A          + kms_key_id            = (known after apply)%0A          ~ tags                  = {} -> (known after apply)%0A          ~ tags_all              = {} -> (known after apply)%0A          ~ throughput            = 0 -> (known after apply)%0A          ~ volume_id             = "vol-0031b4068a950489b" -> (known after apply)%0A          ~ volume_size           = 8 -> (known after apply)%0A          ~ volume_type           = "gp2" -> (known after apply)%0A        }%0A    }%0A%0A  # aws_instance.bastion_host must be replaced%0A-/+ resource "aws_instance" "bastion_host" {%0A      ~ arn                                  = "arn:aws:ec2:us-east-1:855527989292:instance/i-02967c4b78d940d6f" -> (known after apply)%0A      ~ availability_zone                    = "us-east-1b" -> (known after apply)%0A      ~ cpu_core_count                       = 1 -> (known after apply)%0A      ~ cpu_threads_per_core                 = 1 -> (known after apply)%0A      ~ disable_api_stop                     = false -> (known after apply)%0A      ~ disable_api_termination              = false -> (known after apply)%0A      ~ ebs_optimized                        = false -> (known after apply)%0A      - hibernation                          = false -> null%0A      + host_id                              = (known after apply)%0A      + host_resource_group_arn              = (known after apply)%0A      + iam_instance_profile                 = (known after apply)%0A      ~ id                                   = "i-02967c4b78d940d6f" -> (known after apply)%0A      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)%0A      + instance_lifecycle                   = (known after apply)%0A      ~ instance_state                       = "shutting-down" -> (known after apply)%0A      ~ ipv6_address_count                   = 0 -> (known after apply)%0A      ~ ipv6_addresses                       = [] -> (known after apply)%0A      ~ monitoring                           = false -> (known after apply)%0A      + outpost_arn                          = (known after apply)%0A      + password_data                        = (known after apply)%0A      + placement_group                      = (known after apply)%0A      ~ placement_partition_number           = 0 -> (known after apply)%0A      ~ primary_network_interface_id         = "eni-0b9021dc1260d982a" -> (known after apply)%0A      ~ private_dns                          = "ip-10-1-2-182.ec2.internal" -> (known after apply)%0A      ~ private_ip                           = "10.1.2.182" -> (known after apply)%0A      + public_dns                           = (known after apply)%0A      ~ public_ip                            = "54.146.12.89" -> (known after apply)%0A      ~ secondary_private_ips                = [] -> (known after apply)%0A      ~ security_groups                      = [ # forces replacement%0A          + "sg-0fec65fb7834aed15",%0A        ]%0A      + spot_instance_request_id             = (known after apply)%0A        tags                                 = {%0A            "App"   = "Web"%0A            "Name"  = "Webserver2"%0A            "Owner" = "CAAacs730"%0A            "env"   = "Prod"%0A        }%0A      ~ tenancy                              = "default" -> (known after apply)%0A      + user_data_base64                     = (known after apply)%0A      ~ vpc_security_group_ids               = [%0A          - "sg-0fec65fb7834aed15",%0A        ] -> (known after apply)%0A        # (10 unchanged attributes hidden)%0A%0A      ~ capacity_reservation_specification {%0A          ~ capacity_reservation_preference = "open" -> (known after apply)%0A%0A          + capacity_reservation_target {%0A              + capacity_reservation_id                 = (known after apply)%0A              + capacity_reservation_resource_group_arn = (known after apply)%0A            }%0A        }%0A%0A      ~ cpu_options {%0A          + amd_sev_snp      = (known after apply)%0A          ~ core_count       = 1 -> (known after apply)%0A          ~ threads_per_core = 1 -> (known after apply)%0A        }%0A%0A      - credit_specification {%0A          - cpu_credits = "standard" -> null%0A        }%0A%0A      + ebs_block_device {%0A          + delete_on_termination = (known after apply)%0A          + device_name           = (known after apply)%0A          + encrypted             = (known after apply)%0A          + iops                  = (known after apply)%0A          + kms_key_id            = (known after apply)%0A          + snapshot_id           = (known after apply)%0A          + tags                  = (known after apply)%0A          + tags_all              = (known after apply)%0A          + throughput            = (known after apply)%0A          + volume_id             = (known after apply)%0A          + volume_size           = (known after apply)%0A          + volume_type           = (known after apply)%0A        }%0A%0A      ~ enclave_options {%0A          ~ enabled = false -> (known after apply)%0A        }%0A%0A      + ephemeral_block_device {%0A          + device_name  = (known after apply)%0A          + no_device    = (known after apply)%0A          + virtual_name = (known after apply)%0A        }%0A%0A      + instance_market_options {%0A          + market_type = (known after apply)%0A%0A          + spot_options {%0A              + instance_interruption_behavior = (known after apply)%0A              + max_price                      = (known after apply)%0A              + spot_instance_type             = (known after apply)%0A              + valid_until                    = (known after apply)%0A            }%0A        }%0A%0A      ~ maintenance_options {%0A          ~ auto_recovery = "default" -> (known after apply)%0A        }%0A%0A      ~ metadata_options {%0A          ~ http_endpoint               = "enabled" -> (known after apply)%0A          ~ http_protocol_ipv6          = "disabled" -> (known after apply)%0A          ~ http_put_response_hop_limit = 1 -> (known after apply)%0A          ~ http_tokens                 = "optional" -> (known after apply)%0A          ~ instance_metadata_tags      = "disabled" -> (known after apply)%0A        }%0A%0A      + network_interface {%0A          + delete_on_termination = (known after apply)%0A          + device_index          = (known after apply)%0A          + network_card_index    = (known after apply)%0A          + network_interface_id  = (known after apply)%0A        }%0A%0A      ~ private_dns_name_options {%0A          ~ enable_resource_name_dns_a_record    = false -> (known after apply)%0A          ~ enable_resource_name_dns_aaaa_record = false -> (known after apply)%0A          ~ hostname_type                        = "ip-name" -> (known after apply)%0A        }%0A%0A      ~ root_block_device {%0A          ~ delete_on_termination = true -> (known after apply)%0A          ~ device_name           = "/dev/xvda" -> (known after apply)%0A          ~ encrypted             = false -> (known after apply)%0A          ~ iops                  = 100 -> (known after apply)%0A          + kms_key_id            = (known after apply)%0A          ~ tags                  = {} -> (known after apply)%0A          ~ tags_all              = {} -> (known after apply)%0A          ~ throughput            = 0 -> (known after apply)%0A          ~ volume_id             = "vol-0a6bded4184cf3ccb" -> (known after apply)%0A          ~ volume_size           = 8 -> (known after apply)%0A          ~ volume_type           = "gp2" -> (known after apply)%0A        }%0A    }%0A%0A  # aws_instance.vm_instances[0] must be replaced%0A-/+ resource "aws_instance" "vm_instances" {%0A      ~ arn                                  = "arn:aws:ec2:us-east-1:855527989292:instance/i-083a2b636581320a9" -> (known after apply)%0A      ~ associate_public_ip_address          = false -> (known after apply)%0A      ~ availability_zone                    = "us-east-1a" -> (known after apply)%0A      ~ cpu_core_count                       = 1 -> (known after apply)%0A      ~ cpu_threads_per_core                 = 1 -> (known after apply)%0A      ~ disable_api_stop                     = false -> (known after apply)%0A      ~ disable_api_termination              = false -> (known after apply)%0A      ~ ebs_optimized                        = false -> (known after apply)%0A      - hibernation                          = false -> null%0A      + host_id                              = (known after apply)%0A      + host_resource_group_arn              = (known after apply)%0A      + iam_instance_profile                 = (known after apply)%0A      ~ id                                   = "i-083a2b636581320a9" -> (known after apply)%0A      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)%0A      + instance_lifecycle                   = (known after apply)%0A      ~ instance_state                       = "shutting-down" -> (known after apply)%0A      ~ ipv6_address_count                   = 0 -> (known after apply)%0A      ~ ipv6_addresses                       = [] -> (known after apply)%0A      ~ monitoring                           = false -> (known after apply)%0A      + outpost_arn                          = (known after apply)%0A      + password_data                        = (known after apply)%0A      + placement_group                      = (known after apply)%0A      ~ placement_partition_number           = 0 -> (known after apply)%0A      ~ primary_network_interface_id         = "eni-00b34afbfa7df1096" -> (known after apply)%0A      ~ private_dns                          = "ip-10-1-5-213.ec2.internal" -> (known after apply)%0A      ~ private_ip                           = "10.1.5.213" -> (known after apply)%0A      + public_dns                           = (known after apply)%0A      + public_ip                            = (known after apply)%0A      ~ secondary_private_ips                = [] -> (known after apply)%0A      ~ security_groups                      = [ # forces replacement%0A          + "sg-031681603caa7730b",%0A        ]%0A      + spot_instance_request_id             = (known after apply)%0A        tags                                 = {%0A            "App"   = "Web"%0A            "Name"  = "Prod-private-5"%0A            "Owner" = "CAAacs730"%0A            "env"   = "Prod"%0A        }%0A      ~ tenancy                              = "default" -> (known after apply)%0A      + user_data                            = (known after apply)%0A      + user_data_base64                     = (known after apply)%0A      ~ vpc_security_group_ids               = [%0A          - "sg-031681603caa7730b",%0A        ] -> (known after apply)%0A        # (8 unchanged attributes hidden)%0A%0A      ~ capacity_reservation_specification {%0A          ~ capacity_reservation_preference = "open" -> (known after apply)%0A%0A          + capacity_reservation_target {%0A              + capacity_reservation_id                 = (known after apply)%0A              + capacity_reservation_resource_group_arn = (known after apply)%0A            }%0A        }%0A%0A      ~ cpu_options {%0A          + amd_sev_snp      = (known after apply)%0A          ~ core_count       = 1 -> (known after apply)%0A          ~ threads_per_core = 1 -> (known after apply)%0A        }%0A%0A      - credit_specification {%0A          - cpu_credits = "standard" -> null%0A        }%0A%0A      + ebs_block_device {%0A          + delete_on_termination = (known after apply)%0A          + device_name           = (known after apply)%0A          + encrypted             = (known after apply)%0A          + iops                  = (known after apply)%0A          + kms_key_id            = (known after apply)%0A          + snapshot_id           = (known after apply)%0A          + tags                  = (known after apply)%0A          + tags_all              = (known after apply)%0A          + throughput            = (known after apply)%0A          + volume_id             = (known after apply)%0A          + volume_size           = (known after apply)%0A          + volume_type           = (known after apply)%0A        }%0A%0A      ~ enclave_options {%0A          ~ enabled = false -> (known after apply)%0A        }%0A%0A      + ephemeral_block_device {%0A          + device_name  = (known after apply)%0A          + no_device    = (known after apply)%0A          + virtual_name = (known after apply)%0A        }%0A%0A      + instance_market_options {%0A          + market_type = (known after apply)%0A%0A          + spot_options {%0A              + instance_interruption_behavior = (known after apply)%0A              + max_price                      = (known after apply)%0A              + spot_instance_type             = (known after apply)%0A              + valid_until                    = (known after apply)%0A            }%0A        }%0A%0A      ~ maintenance_options {%0A          ~ auto_recovery = "default" -> (known after apply)%0A        }%0A%0A      ~ metadata_options {%0A          ~ http_endpoint               = "enabled" -> (known after apply)%0A          ~ http_protocol_ipv6          = "disabled" -> (known after apply)%0A          ~ http_put_response_hop_limit = 1 -> (known after apply)%0A          ~ http_tokens                 = "optional" -> (known after apply)%0A          ~ instance_metadata_tags      = "disabled" -> (known after apply)%0A        }%0A%0A      + network_interface {%0A          + delete_on_termination = (known after apply)%0A          + device_index          = (known after apply)%0A          + network_card_index    = (known after apply)%0A          + network_interface_id  = (known after apply)%0A        }%0A%0A      ~ private_dns_name_options {%0A          ~ enable_resource_name_dns_a_record    = false -> (known after apply)%0A          ~ enable_resource_name_dns_aaaa_record = false -> (known after apply)%0A          ~ hostname_type                        = "ip-name" -> (known after apply)%0A        }%0A%0A      ~ root_block_device {%0A          ~ delete_on_termination = true -> (known after apply)%0A          ~ device_name           = "/dev/xvda" -> (known after apply)%0A          ~ encrypted             = false -> (known after apply)%0A          ~ iops                  = 100 -> (known after apply)%0A          + kms_key_id            = (known after apply)%0A          ~ tags                  = {} -> (known after apply)%0A          ~ tags_all              = {} -> (known after apply)%0A          ~ throughput            = 0 -> (known after apply)%0A          ~ volume_id             = "vol-0821bae68f2ab275b" -> (known after apply)%0A          ~ volume_size           = 8 -> (known after apply)%0A          ~ volume_type           = "gp2" -> (known after apply)%0A        }%0A    }%0A%0A  # aws_instance.vm_instances[1] must be replaced%0A-/+ resource "aws_instance" "vm_instances" {%0A      ~ arn                                  = "arn:aws:ec2:us-east-1:855527989292:instance/i-053ed264fa2f5fba2" -> (known after apply)%0A      ~ associate_public_ip_address          = false -> (known after apply)%0A      ~ availability_zone                    = "us-east-1b" -> (known after apply)%0A      ~ cpu_core_count                       = 1 -> (known after apply)%0A      ~ cpu_threads_per_core                 = 1 -> (known after apply)%0A      ~ disable_api_stop                     = false -> (known after apply)%0A      ~ disable_api_termination              = false -> (known after apply)%0A      ~ ebs_optimized                        = false -> (known after apply)%0A      - hibernation                          = false -> null%0A      + host_id                              = (known after apply)%0A      + host_resource_group_arn              = (known after apply)%0A      + iam_instance_profile                 = (known after apply)%0A      ~ id                                   = "i-053ed264fa2f5fba2" -> (known after apply)%0A      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)%0A      + instance_lifecycle                   = (known after apply)%0A      ~ instance_state                       = "shutting-down" -> (known after apply)%0A      ~ ipv6_address_count                   = 0 -> (known after apply)%0A      ~ ipv6_addresses                       = [] -> (known after apply)%0A      ~ monitoring                           = false -> (known after apply)%0A      + outpost_arn                          = (known after apply)%0A      + password_data                        = (known after apply)%0A      + placement_group                      = (known after apply)%0A      ~ placement_partition_number           = 0 -> (known after apply)%0A      ~ primary_network_interface_id         = "eni-0b10ec91ed9c61ea7" -> (known after apply)%0A      ~ private_dns                          = "ip-10-1-6-136.ec2.internal" -> (known after apply)%0A      ~ private_ip                           = "10.1.6.136" -> (known after apply)%0A      + public_dns                           = (known after apply)%0A      + public_ip                            = (known after apply)%0A      ~ secondary_private_ips                = [] -> (known after apply)%0A      ~ security_groups                      = [ # forces replacement%0A          + "sg-031681603caa7730b",%0A        ]%0A      + spot_instance_request_id             = (known after apply)%0A        tags                                 = {%0A            "App"   = "Web"%0A            "Name"  = "Prod-private-6"%0A            "Owner" = "CAAacs730"%0A            "env"   = "Prod"%0A        }%0A      ~ tenancy                              = "default" -> (known after apply)%0A      + user_data                            = (known after apply)%0A      + user_data_base64                     = (known after apply)%0A      ~ vpc_security_group_ids               = [%0A          - "sg-031681603caa7730b",%0A        ] -> (known after apply)%0A        # (8 unchanged attributes hidden)%0A%0A      ~ capacity_reservation_specification {%0A          ~ capacity_reservation_preference = "open" -> (known after apply)%0A%0A          + capacity_reservation_target {%0A              + capacity_reservation_id                 = (known after apply)%0A              + capacity_reservation_resource_group_arn = (known after apply)%0A            }%0A        }%0A%0A      ~ cpu_options {%0A          + amd_sev_snp      = (known after apply)%0A          ~ core_count       = 1 -> (known after apply)%0A          ~ threads_per_core = 1 -> (known after apply)%0A        }%0A%0A      - credit_specification {%0A          - cpu_credits = "standard" -> null%0A        }%0A%0A      + ebs_block_device {%0A          + delete_on_termination = (known after apply)%0A          + device_name           = (known after apply)%0A          + encrypted             = (known after apply)%0A          + iops                  = (known after apply)%0A          + kms_key_id            = (known after apply)%0A          + snapshot_id           = (known after apply)%0A          + tags                  = (known after apply)%0A          + tags_all              = (known after apply)%0A          + throughput            = (known after apply)%0A          + volume_id             = (known after apply)%0A          + volume_size           = (known after apply)%0A          + volume_type           = (known after apply)%0A        }%0A%0A      ~ enclave_options {%0A          ~ enabled = false -> (known after apply)%0A        }%0A%0A      + ephemeral_block_device {%0A          + device_name  = (known after apply)%0A          + no_device    = (known after apply)%0A          + virtual_name = (known after apply)%0A        }%0A%0A      + instance_market_options {%0A          + market_type = (known after apply)%0A%0A          + spot_options {%0A              + instance_interruption_behavior = (known after apply)%0A              + max_price                      = (known after apply)%0A              + spot_instance_type             = (known after apply)%0A              + valid_until                    = (known after apply)%0A            }%0A        }%0A%0A      ~ maintenance_options {%0A          ~ auto_recovery = "default" -> (known after apply)%0A        }%0A%0A      ~ metadata_options {%0A          ~ http_endpoint               = "enabled" -> (known after apply)%0A          ~ http_protocol_ipv6          = "disabled" -> (known after apply)%0A          ~ http_put_response_hop_limit = 1 -> (known after apply)%0A          ~ http_tokens                 = "optional" -> (known after apply)%0A          ~ instance_metadata_tags      = "disabled" -> (known after apply)%0A        }%0A%0A      + network_interface {%0A          + delete_on_termination = (known after apply)%0A          + device_index          = (known after apply)%0A          + network_card_index    = (known after apply)%0A          + network_interface_id  = (known after apply)%0A        }%0A%0A      ~ private_dns_name_options {%0A          ~ enable_resource_name_dns_a_record    = false -> (known after apply)%0A          ~ enable_resource_name_dns_aaaa_record = false -> (known after apply)%0A          ~ hostname_type                        = "ip-name" -> (known after apply)%0A        }%0A%0A      ~ root_block_device {%0A          ~ delete_on_termination = true -> (known after apply)%0A          ~ device_name           = "/dev/xvda" -> (known after apply)%0A          ~ encrypted             = false -> (known after apply)%0A          ~ iops                  = 100 -> (known after apply)%0A          + kms_key_id            = (known after apply)%0A          ~ tags                  = {} -> (known after apply)%0A          ~ tags_all              = {} -> (known after apply)%0A          ~ throughput            = 0 -> (known after apply)%0A          ~ volume_id             = "vol-07702444a22b858cd" -> (known after apply)%0A          ~ volume_size           = 8 -> (known after apply)%0A          ~ volume_type           = "gp2" -> (known after apply)%0A        }%0A    }%0A%0A  # aws_lb.main_alb will be created%0A  + resource "aws_lb" "main_alb" {%0A      + arn                                                          = (known after apply)%0A      + arn_suffix                                                   = (known after apply)%0A      + desync_mitigation_mode                                       = "defensive"%0A      + dns_name                                                     = (known after apply)%0A      + drop_invalid_header_fields                                   = false%0A      + enable_deletion_protection                                   = false%0A      + enable_http2                                                 = true%0A      + enable_tls_version_and_cipher_suite_headers                  = false%0A      + enable_waf_fail_open                                         = false%0A      + enable_xff_client_port                                       = false%0A      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)%0A      + id                                                           = (known after apply)%0A      + idle_timeout                                                 = 60%0A      + internal                                                     = false%0A      + ip_address_type                                              = (known after apply)%0A      + load_balancer_type                                           = "application"%0A      + name                                                         = "alb"%0A      + name_prefix                                                  = (known after apply)%0A      + preserve_host_header                                         = false%0A      + security_groups                                              = [%0A          + "sg-05d32e424b072a887",%0A        ]%0A      + subnets                                                      = [%0A          + "subnet-0122b6d0458ad8226",%0A          + "subnet-079310e31105f4472",%0A          + "subnet-0d3c8350d08ea83a8",%0A        ]%0A      + tags                                                         = {%0A          + "App"   = "Web"%0A          + "Name"  = "Prod-alb"%0A          + "Owner" = "CAAacs730"%0A          + "env"   = "Prod"%0A        }%0A      + tags_all                                                     = {%0A          + "App"   = "Web"%0A          + "Name"  = "Prod-alb"%0A          + "Owner" = "CAAacs730"%0A          + "env"   = "Prod"%0A        }%0A      + vpc_id                                                       = (known after apply)%0A      + xff_header_processing_mode                                   = "append"%0A      + zone_id                                                      = (known after apply)%0A%0A      + subnet_mapping {%0A          + allocation_id        = (known after apply)%0A          + ipv6_address         = (known after apply)%0A          + outpost_id           = (known after apply)%0A          + private_ipv4_address = (known after apply)%0A          + subnet_id            = (known after apply)%0A        }%0A    }%0A%0A  # aws_lb_listener.http_listener will be created%0A  + resource "aws_lb_listener" "http_listener" {%0A      + arn               = (known after apply)%0A      + id                = (known after apply)%0A      + load_balancer_arn = (known after apply)%0A      + port              = 80%0A      + protocol          = "HTTP"%0A      + ssl_policy        = (known after apply)%0A      + tags_all          = (known after apply)%0A%0A      + default_action {%0A          + order            = (known after apply)%0A          + target_group_arn = (known after apply)%0A          + type             = "forward"%0A        }%0A%0A      + mutual_authentication {%0A          + ignore_client_certificate_expiry = (known after apply)%0A          + mode                             = (known after apply)%0A          + trust_store_arn                  = (known after apply)%0A        }%0A    }%0A%0A  # aws_lb_target_group.tg1 will be created%0A  + resource "aws_lb_target_group" "tg1" {%0A      + arn                                = (known after apply)%0A      + arn_suffix                         = (known after apply)%0A      + connection_termination             = (known after apply)%0A      + deregistration_delay               = "300"%0A      + id                                 = (known after apply)%0A      + ip_address_type                    = (known after apply)%0A      + lambda_multi_value_headers_enabled = false%0A      + load_balancer_arns                 = (known after apply)%0A      + load_balancing_algorithm_type      = (known after apply)%0A      + load_balancing_anomaly_mitigation  = (known after apply)%0A      + load_balancing_cross_zone_enabled  = (known after apply)%0A      + name                               = "tg-1"%0A      + name_prefix                        = (known after apply)%0A      + port                               = 80%0A      + preserve_client_ip                 = (known after apply)%0A      + protocol                           = "HTTP"%0A      + protocol_version                   = (known after apply)%0A      + proxy_protocol_v2                  = false%0A      + slow_start                         = 0%0A      + tags                               = {%0A          + "App"   = "Web"%0A          + "Name"  = "Prod-tg-1"%0A          + "Owner" = "CAAacs730"%0A          + "env"   = "Prod"%0A        }%0A      + tags_all                           = {%0A          + "App"   = "Web"%0A          + "Name"  = "Prod-tg-1"%0A          + "Owner" = "CAAacs730"%0A          + "env"   = "Prod"%0A        }%0A      + target_type   
  ```
  </details>
  *Pusher: @udamad024, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform - Staging`*